In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:1234@localhost:3306/dannys_diner

# Case Study #1 - Danny's Diner
<img src="https://8weeksqlchallenge.com/images/case-study-designs/1.png" width="800" height="800" alt="Danny's Diner"/>

## Introduction
Danny seriously loves Japanese food so in the beginning of 2021, he decides to embark upon a risky venture and opens up a cute little restaurant that sells his 3 favourite foods: sushi, curry and ramen.

Danny’s Diner is in need of your assistance to help the restaurant stay afloat - the restaurant has captured some very basic data from their few months of operation but have no idea how to use their data to help them run the business.
## Problem Statement
Danny wants to use the data to answer a few simple questions about his customers, especially about their visiting patterns, how much money they’ve spent and also which menu items are their favourite. Having this deeper connection with his customers will help him deliver a better and more personalised experience for his loyal customers.

He plans on using these insights to help him decide whether he should expand the existing customer loyalty program - additionally he needs help to generate some basic datasets so his team can easily inspect the data without needing to use SQL.

Danny has provided you with a sample of his overall customer data due to privacy issues - but he hopes that these examples are enough for you to write fully functioning SQL queries to help him answer his questions!

Danny has shared with you 3 key datasets for this case study:

1. sales
1. menu
1. members

# Entity Relationship Diagram
![](https://i.imgur.com/BDpTGbM.png)

In [4]:
%%sql
# lets explore our tables
SELECT *
FROM sales

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
15 rows affected.

[('A', datetime.date(2021, 1, 1), 1),
 ('A', datetime.date(2021, 1, 1), 2),
 ('A', datetime.date(2021, 1, 7), 2),
 ('A', datetime.date(2021, 1, 10), 3),
 ('A', datetime.date(2021, 1, 11), 3),
 ('A', datetime.date(2021, 1, 11), 3),
 ('B', datetime.date(2021, 1, 1), 2),
 ('B', datetime.date(2021, 1, 2), 2),
 ('B', datetime.date(2021, 1, 4), 1),
 ('B', datetime.date(2021, 1, 11), 1),
 ('B', datetime.date(2021, 1, 16), 3),
 ('B', datetime.date(2021, 2, 1), 3),
 ('C', datetime.date(2021, 1, 1), 3),
 ('C', datetime.date(2021, 1, 1), 3),
 ('C', datetime.date(2021, 1, 7), 3)]

In [5]:
%%sql
# lets explore our tables
SELECT *
FROM menu

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
3 rows affected.

[(1, 'sushi', 10), (2, 'curry', 15), (3, 'ramen', 12)]

In [6]:
%%sql
# lets explore our tables
SELECT *
FROM members

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
2 rows affected.

[('A', datetime.date(2021, 1, 7)), ('B', datetime.date(2021, 1, 9))]

# Case Study Questions

1.What is the total amount each customer spent at the restaurant?
## Solution

1. **Join `Sales` and `Menu` Tables**: This join is necessary because the `sales` table doesn't include the price of each item sold.  Joining these tables allows you to associate each sale with its item price.
    
2. **Aggregate Prices**: After joining the tables, use the `SUM()` aggregate function on the `price` column from the `menu` table. This step aggregates the prices of all items purchased by each customer, effectively calculating the total amount spent by each customer at the restaurant.
    
3. **Group by Customer ID**: To ensure that the total amount is calculated separately for each customer, use the `GROUP BY` clause with `customer_id`. This clause groups all sales records by customer, allowing the `SUM()` function to operate on each group independently, providing a total spend for each customer.

In [9]:
%%sql

SELECT 
    s.customer_id,
    SUM(m.price) AS total_spent
FROM 
    sales s
JOIN 
    menu m 
    using(product_id)
GROUP BY 
    s.customer_id;

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
3 rows affected.

[('A', Decimal('76')), ('B', Decimal('74')), ('C', Decimal('36'))]

2.How many days has each customer visited the restaurant?
## Solution
- To answer this question we need to 
    1. **Counts Unique Dates** using `COUNT(DISTINCT order_date)` to ensure multiple orders on the same day are counted as a single visit.
    2. **Groups Results** by `customer_id` to get the visit count for each customer individually.

In [10]:
%%sql
SELECT 
    customer_id,
    count(distinct order_date) as num_visited_days
FROM
    sales
GROUP BY
    customer_id

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
3 rows affected.

[('A', 4), ('B', 6), ('C', 2)]

3. What was the first item from the menu purchased by each customer?
## Solution
- To answer this question we need to 
    1. **Query the First Item:**
        - Use a Common Table Expression (CTE) or subquery to determine the first purchase date for each customer by selecting the minimum `order_date` from the sales table for each `customer_id`.
        - Include the `product_id` in the selection to identify what was purchased on that first visit.
    2. **Join Sales Table:**
        - Join this result (from step 1) back to the sales table to get the full details of the first purchase, ensuring the join condition matches both `customer_id` and the earliest `order_date`.
    3. **Join Menu Table:**
        - Finally, join the result with the menu table on product_id to retrieve the product_name of the first item purchased.
        This step translates the product_id from the first purchase into a readable product_name.

In [23]:
%%sql
WITH FirstPurchase AS(
    SELECT
        s.customer_id,
        s.order_date,
        s.product_id
    FROM 
        sales AS s
    INNER JOIN(
        SELECT
        customer_id,
        MIN(order_date) as first_order_date
    FROM 
        sales
    GROUP BY 
        customer_id
    ) AS F 
    ON F.customer_id = s.customer_id AND F.first_order_date = s.order_date
)

SELECT
    fp.customer_id,
    m.product_name AS first_item_purchased
FROM
    FirstPurchase as fp
JOIN menu AS m
ON fp.product_id = m.product_id;

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
5 rows affected.

[('A', 'sushi'),
 ('A', 'curry'),
 ('B', 'curry'),
 ('C', 'ramen'),
 ('C', 'ramen')]

4. What is the most purchased item on the menu and how many times was it purchased by all customers?
## Solution
- To find the most purchased item from the menu, the SQL query follows these steps:

    1. **Join Sales and Menu Tables:** The query joins the Sales table with the Menu table on the `product_id` column to correlate each sale with the corresponding menu item.

    2. **Count Purchases:** It performs a `COUNT` aggregation on `s.product_id` to calculate the total number of times each menu item was purchased. This count is aliased as most_purchased_item.

    3. **Group by Menu Item:** The query groups the results by `product_name` to ensure the count is calculated separately for each menu item.

    4. **Order Results:** The results are ordered by `most_purchased_item` in descending order `(DESC)`, putting the most purchased item at the top.

    5. **Limit to Top Item:** The `LIMIT 1` clause is applied to select only the top result, which is the menu item with the highest purchase count.

In [29]:
%%sql
SELECT
    m.product_name,
    COUNT(s.product_id) AS most_purchased_item
FROM 
    Sales AS s
JOIN 
    menu AS m USING(product_id)
GROUP BY product_name 
ORDER BY most_purchased_item desc
LIMIT 1

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
1 rows affected.

[('ramen', 8)]


5. Which item was the most popular for each customer?

## Solution
1. **Join Sales and Menu Tables**: The query combines the `Sales` and `Menu` tables using the `product_id` field. 
2. **Count Purchases**: Utilizes the `COUNT` function on `s.product_id` to tally the total number of times each customer ordered each menu item. This total is crucial for determining which items are favored by each customer.
    
3. **Rank Items for Each Customer**: Implements a window function like `RANK()` (or `ROW_NUMBER()` for no ties), partitioned by `customer_id`. This ranks items based on their purchase counts per customer, ensuring the ranking is specific to each customer's buying habits.
    
4. **Filter for Top Items**: Applies a condition to select only the items with the highest rank (i.e., rank = 1) for each customer. This step is essential to identify the most preferred item per customer.
    
5. **Group by Customer and Menu Item**: The results are grouped by both `customer_id` and `product_name`.

In [64]:
%%sql
WITH RankedItems  AS(
    SELECT
         s.customer_id,
         m.product_name,
         COUNT(s.product_id) AS order_count,
         RANK() OVER(PARTITION BY s.customer_id ORDER BY COUNT(s.product_id) DESC) AS rank_num
    FROM 
        sales AS s
    JOIN
        menu AS m ON (s.product_id = m.product_id)    
    GROUP BY 
        s.customer_id, m.product_name

)
SELECT 
        customer_id,
        product_name,
        order_count
FROM RankedItems 
WHERE rank_num = 1

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
5 rows affected.

[('A', 'ramen', 3),
 ('B', 'curry', 2),
 ('B', 'sushi', 2),
 ('B', 'ramen', 2),
 ('C', 'ramen', 3)]


6. Which item was purchased first by the customer after they became a member?


## Solution:
1. **Create a CTE (`after_be_member`)**: This CTE filters and ranks sales records for customers after they have joined as members.
    
    - **Join `sales` and `members`**: Combines the `sales` (alias `s`) and `members` (alias `m`) tables on `customer_id` to match each sale with the corresponding member.
    - **Filter by Join Date**: Includes only sales that occurred on or after each customer's join date (`s.order_date >= m.join_date`), ensuring that only purchases made after becoming a member are considered.
    - **Rank Sales**: Applies the `RANK()` window function, partitioned by `customer_id` and ordered by `order_date`. This assigns a rank to each sale for a customer, starting with 1 for the earliest post-membership purchase.
2. **Select from the CTE**: The main query selects data from the `after_be_member` CTE.
    
    - **Join with `menu`**: Joins the CTE (alias `a`) with the `menu` table (alias `m`) on `product_id` to correlate each sale with the specific menu item purchased.
    - **Filter for First Purchases**: Uses `WHERE rank_num = 1` to narrow down the results to only the first purchase each customer made after becoming a member (the sale with a rank of 1).
3. **Retrieve Relevant Data**: The final `SELECT` statement fetches `customer_id` and the `product_name` of the first item purchased after membership commencement.

In [81]:
%%sql
WITH after_be_member AS(SELECT
        s.customer_id,
        s.order_date,
        s.product_id,
        m.join_date,
        RANK() OVER(PARTITION BY s.customer_id ORDER BY order_date) AS rank_num
    FROM
        sales s
    JOIN
        members m ON (s.customer_id = m.customer_id)

    Where 
        s.order_date >= m.join_date)
SELECT
    customer_id,
    m.product_name
FROM
    after_be_member a
JOIN
    menu m on(m.product_id = a.product_id)
WHERE
   rank_num = 1

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
2 rows affected.

[('B', 'sushi'), ('A', 'curry')]

7. Which item was purchased just before the customer became a member?

## Solution:

This SQL query have a significant modification from the previous query that focused on the first purchase after becoming a member. Here's how this query differs and aligns with the new objective:

### Differences in Approach:

1. **Order Date Filter**:
    
    - Previous Query: Filtered for sales `WHERE s.order_date >= m.join_date`, including only sales that occurred after the customer joined as a member.
    - Current Query: Uses `WHERE s.order_date < m.join_date`, which includes only sales before the customer's membership started, focusing on the last purchase before becoming a member.
2. **Ranking Order**:
    
    - Previous Query: Applied `RANK() OVER(PARTITION BY s.customer_id ORDER BY order_date)` without specifying order direction, which defaults to ascending, thereby ranking earlier purchases with a lower rank (i.e., 1 for the earliest).
    - Current Query: Uses `RANK() OVER(PARTITION BY s.customer_id ORDER BY order_date DESC)`, explicitly ordering by `order_date` in descending order. This means the most recent purchase before membership gets ranked as 1.

In [83]:
%%sql
WITH before_be_member AS(SELECT
        s.customer_id,
        s.order_date,
        s.product_id,
        m.join_date,
        RANK() OVER(PARTITION BY s.customer_id ORDER BY order_date desc) AS rank_num
    FROM
        sales s
    JOIN
        members m ON (s.customer_id = m.customer_id)

    Where 
        s.order_date < m.join_date)
SELECT
    customer_id,
    m.product_name
FROM
    before_be_member a
JOIN
    menu m on(m.product_id = a.product_id)
WHERE
   rank_num = 1

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
3 rows affected.

[('A', 'sushi'), ('B', 'sushi'), ('A', 'curry')]

8. What is the total items and amount spent for each member before they became a member?


## Solution:

- **Join with Menu**: Connects the CTE to the `menu` table using `product_id` to fetch the price of each item sold in the pre-membership period.
- **Aggregations**:
    - `SUM(m.price) AS total_amount`: Calculates the total money spent by each customer on purchases made before becoming a member.
    - `COUNT(m.price) AS total_items`: Counts the total number of items each customer purchased in the same period.
- **Grouping**: The `GROUP BY customer_id` clause ensures that the sums and counts are calculated separately for each customer, providing a clear breakdown of pre-membership spending and activity.

In [87]:
%%sql
WITH before_be_member AS(SELECT
        s.customer_id,
        s.order_date,
        s.product_id,
        m.join_date
    FROM
        sales s
    JOIN
        members m ON (s.customer_id = m.customer_id)

    Where 
        s.order_date < m.join_date)
SELECT
    customer_id,
    SUM(m.price) AS total_amount,
    COUNT(m.price) AS total_items
FROM
    before_be_member a
JOIN
    menu m on(m.product_id = a.product_id)
GROUP BY 
    customer_id
ORDER BY
    customer_id

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
2 rows affected.

[('A', Decimal('25'), 2), ('B', Decimal('40'), 3)]

9. If each $1 spent equates to 10 points and sushi has a 2x points multiplier — how many points would each customer have?




## Solution:

1. **`CASE` statement inside `SUM`**:
    
    - The `CASE` statement is used here to apply conditional logic to how points are calculated based on the `product_id`.
    - `WHEN '1' THEN price*20`: If the `product_id` is '1' **(sushi)**, the price of the product is multiplied by 20 to calculate the points.
    - `ELSE price*10`: For all other `product_id` values, the price is multiplied by 10 to calculate the points.
1. **`JOIN menu m USING(product_id)`**:
    
    - This joins the `sales` table with the `menu` table using the `product_id` column that is common to both tables. The `menu` table is aliased as `m`.
    - This join is necessary to access the `price` of each product, which is presumably stored in the `menu` table.
1. **`GROUP BY customer_id`**:
    
    - This groups the results by `customer_id`, ensuring that the SUM operation is performed separately for each customer. The result is that you get a total points value for each customer based on their purchases.

In [90]:
%%sql
SELECT
    customer_id,
    SUM(CASE product_id
        WHEN '1' THEN price*20
        ELSE price*10
    END) AS points
FROM sales s
JOIN menu m USING(product_id)
GROUP BY customer_id

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
3 rows affected.

[('A', Decimal('860')), ('B', Decimal('940')), ('C', Decimal('360'))]

10. In the first week after a customer joins the program (including their join date) they earn 2x points on all items, not just sushi - how many points do customer A and B have at the end of January?





## Solution:


1. **Calculate Points with `SUM` and `CASE`**:
    
    - The `SUM` function is used to aggregate the points earned by each customer. Inside the `SUM`, a `CASE` statement is used to determine how many points each order earns.
    - For orders placed within the first week after the customer's join date (`s.order_date BETWEEN mem.join_date AND DATE_ADD(mem.join_date, INTERVAL 6 DAY)`), each item in the order earns 20 points per unit of price.
    - If the order includes the specific product (`product_id = '1'`, assumed to be sushi based on your description), and it's outside the first week, it also earns 20 points per unit of price.
    - All other items ordered outside the first week earn 10 points per unit of price.
2. **Join Tables**:
    
    - The `sales` table is joined with the `menu` table on `product_id` to access the price of each item ordered. The `menu` table is aliased as `m`.
    - The `sales` table is also joined with the `members` table on `customer_id` to access each customer's join date. The `members` table is aliased as `mem`.
3. **Filter Orders Made in January**:
    
    - The `WHERE MONTH(s.order_date) = 1` clause filters the data to include only orders made in January, regardless of the year. The `MONTH()` function extracts the month part of the `order_date` and compares it to `1`.

In [132]:
%%sql
SELECT
    s.customer_id,
    SUM(
        CASE
            WHEN s.order_date BETWEEN mem.join_date AND DATE_ADD(mem.join_date, INTERVAL 6 DAY) THEN price * 20
            WHEN m.product_id = '1' THEN price * 20 
            ELSE price * 10 
        END
    ) AS points
FROM sales s
JOIN menu m ON s.product_id = m.product_id
JOIN members mem ON s.customer_id = mem.customer_id
WHERE MONTH(s.order_date) = 1
GROUP BY s.customer_id
ORDER BY customer_id;

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
2 rows affected.

[('A', Decimal('1370')), ('B', Decimal('820'))]

# Bonus Questions

Recreate the following table output using the available data:

|customer_id|order_date|product_name|price|member|
|---|---|---|---|---|
|A|2021-01-01|curry|15|N|
## Solution
1. **(CTE) for Membership Status**: This CTE helps to later determine if a customer was a member at the time of their order.
2. **Determining Membership at the Time of Order**:  The query uses a `CASE` statement to determine if an order was made by a member or a non-member.
    - It compares the `order_date` from the `sales` table with the `join_date` from the `if_member` CTE for the same `customer_id`.
    - If the `order_date` is on or after the `join_date`, the `CASE` statement returns 'Y' (indicating the customer was a member at the time of the order). Otherwise, it returns 'N'.

In [148]:
%%sql
WITH if_member AS(
    SELECT join_date,customer_id
    FROM members
)

SELECT
    s.customer_id,
    s.order_date,
    m.product_name,
    m.price,
    CASE 
        WHEN s.order_date >= (SELECT join_date FROM if_member as i WHERE s.customer_id =i.customer_id) THEN 'Y'
        ELSE 'N'
    END AS member
    
FROM sales s
JOIN menu m ON s.product_id = m.product_id

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
15 rows affected.

[('A', datetime.date(2021, 1, 1), 'sushi', 10, 'N'),
 ('A', datetime.date(2021, 1, 1), 'curry', 15, 'N'),
 ('A', datetime.date(2021, 1, 7), 'curry', 15, 'Y'),
 ('A', datetime.date(2021, 1, 10), 'ramen', 12, 'Y'),
 ('A', datetime.date(2021, 1, 11), 'ramen', 12, 'Y'),
 ('A', datetime.date(2021, 1, 11), 'ramen', 12, 'Y'),
 ('B', datetime.date(2021, 1, 1), 'curry', 15, 'N'),
 ('B', datetime.date(2021, 1, 2), 'curry', 15, 'N'),
 ('B', datetime.date(2021, 1, 4), 'sushi', 10, 'N'),
 ('B', datetime.date(2021, 1, 11), 'sushi', 10, 'Y'),
 ('B', datetime.date(2021, 1, 16), 'ramen', 12, 'Y'),
 ('B', datetime.date(2021, 2, 1), 'ramen', 12, 'Y'),
 ('C', datetime.date(2021, 1, 1), 'ramen', 12, 'N'),
 ('C', datetime.date(2021, 1, 1), 'ramen', 12, 'N'),
 ('C', datetime.date(2021, 1, 7), 'ramen', 12, 'N')]

In [156]:
%%sql
WITH MemberStatus AS (
    SELECT
        s.customer_id,
        s.order_date,
        m.product_name,
        m.price,
        CASE
            WHEN s.order_date >= COALESCE((SELECT MIN(join_date) FROM members WHERE s.customer_id = members.customer_id), '9999-12-31') THEN 'Y'
            ELSE 'N'
        END AS member
    FROM sales s
    JOIN menu m ON s.product_id = m.product_id
)

SELECT
    customer_id,
    order_date,
    product_name,
    price,
    member,
    CASE
        WHEN member = 'Y' THEN RANK() OVER (PARTITION BY customer_id ORDER BY order_date, product_name)
    END AS ranking
FROM MemberStatus
ORDER BY customer_id, order_date, product_name;

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
15 rows affected.

[('A', datetime.date(2021, 1, 1), 'curry', 15, 'N', None),
 ('A', datetime.date(2021, 1, 1), 'sushi', 10, 'N', None),
 ('A', datetime.date(2021, 1, 7), 'curry', 15, 'Y', 3),
 ('A', datetime.date(2021, 1, 10), 'ramen', 12, 'Y', 4),
 ('A', datetime.date(2021, 1, 11), 'ramen', 12, 'Y', 5),
 ('A', datetime.date(2021, 1, 11), 'ramen', 12, 'Y', 5),
 ('B', datetime.date(2021, 1, 1), 'curry', 15, 'N', None),
 ('B', datetime.date(2021, 1, 2), 'curry', 15, 'N', None),
 ('B', datetime.date(2021, 1, 4), 'sushi', 10, 'N', None),
 ('B', datetime.date(2021, 1, 11), 'sushi', 10, 'Y', 4),
 ('B', datetime.date(2021, 1, 16), 'ramen', 12, 'Y', 5),
 ('B', datetime.date(2021, 2, 1), 'ramen', 12, 'Y', 6),
 ('C', datetime.date(2021, 1, 1), 'ramen', 12, 'N', None),
 ('C', datetime.date(2021, 1, 1), 'ramen', 12, 'N', None),
 ('C', datetime.date(2021, 1, 7), 'ramen', 12, 'N', None)]